In [16]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd

In [17]:
database_name = 'prescribers'
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}" 
engine = create_engine(connection_string)

1. How many npi numbers appear in the prescriber table but not in the prescription table?

In [18]:
query = '''
SELECT COUNT(DISTINCT npi)
FROM prescriber
WHERE npi NOT IN
	(SELECT DISTINCT npi
	 FROM prescription)
'''

result = engine.execute(query)

answer = pd.read_sql(query, con = engine)
answer

# 4458

   count
0   4458

2.
    a. Find the top five drugs (generic_name) prescribed by prescribers with the specialty of Family Practice.

    b. Find the top five drugs (generic_name) prescribed by prescribers with the specialty of Cardiology.

    c. Which drugs appear in the top five prescribed for both Family Practice prescribers and Cardiologists? Combine what you did for parts a and b into a single query to answer this question.

In [24]:
#2a

query = '''
SELECT generic_name
FROM prescription
LEFT JOIN prescriber
USING(npi)
LEFT JOIN drug
USING(drug_name)
WHERE specialty_description = 'Family Practice'
GROUP BY generic_name
ORDER BY SUM(total_claim_count) DESC
LIMIT 5
'''

result = engine.execute(query)

answer = pd.read_sql(query, con = engine)
print(answer)

'''
0	LEVOTHYROXINE SODIUM
1	LISINOPRIL
2	ATORVASTATIN CALCIUM
3	AMLODIPINE BESYLATE
4	OMEPRAZOLE
'''

           generic_name
0  LEVOTHYROXINE SODIUM
1            LISINOPRIL
2  ATORVASTATIN CALCIUM
3   AMLODIPINE BESYLATE
4            OMEPRAZOLE

'\n0\tLEVOTHYROXINE SODIUM\n1\tLISINOPRIL\n2\tATORVASTATIN CALCIUM\n3\tAMLODIPINE BESYLATE\n4\tOMEPRAZOLE\n'

In [26]:
#2b

query_2b = '''
SELECT generic_name
FROM prescription
LEFT JOIN prescriber
USING(npi)
LEFT JOIN drug
USING(drug_name)
WHERE specialty_description = 'Cardiology'
GROUP BY generic_name
ORDER BY SUM(total_claim_count) DESC
LIMIT 5
'''

result_2b = engine.execute(query_2b)

answer_2b = pd.read_sql(query_2b, con = engine)
print(answer_2b)

'''
0	ATORVASTATIN CALCIUM
1	CARVEDILOL
2	METOPROLOL TARTRATE
3	CLOPIDOGREL BISULFATE
4	AMLODIPINE BESYLATE
'''

            generic_name
0   ATORVASTATIN CALCIUM
1             CARVEDILOL
2    METOPROLOL TARTRATE
3  CLOPIDOGREL BISULFATE
4    AMLODIPINE BESYLATE

'\n0\tATORVASTATIN CALCIUM\n1\tCARVEDILOL\n2\tMETOPROLOL TARTRATE\n3\tCLOPIDOGREL BISULFATE\n4\tAMLODIPINE BESYLATE\n'

In [27]:
#2c

query_2c = '''
WITH
    family_practice AS (
        SELECT 
            generic_name
        FROM prescription
        LEFT JOIN prescriber
        USING(npi)
        LEFT JOIN drug
        USING(drug_name)
        WHERE specialty_description = 'Family Practice'
        GROUP BY generic_name
        ORDER BY SUM(total_claim_count) DESC
        LIMIT 5
    ),
    cardiology AS (
        SELECT 
            generic_name
        FROM prescription
        LEFT JOIN prescriber
        USING(npi)
        LEFT JOIN drug
        USING(drug_name)
        WHERE specialty_description = 'Cardiology'
        GROUP BY generic_name
        ORDER BY SUM(total_claim_count) DESC
        LIMIT 5
    )
SELECT generic_name
FROM family_practice
INNER JOIN cardiology
USING(generic_name)
'''

result_2c = engine.execute(query_2c)

answer_2c = pd.read_sql(query_2c, con = engine)
print(answer_2c)

'''
0	ATORVASTATIN CALCIUM
1	AMLODIPINE BESYLATE
'''

           generic_name
0  ATORVASTATIN CALCIUM
1   AMLODIPINE BESYLATE

'\n0\tATORVASTATIN CALCIUM\n1\tAMLODIPINE BESYLATE\n'

3. Your goal in this question is to generate a list of the top prescribers in each of the major metropolitan areas of Tennessee.
    a. First, write a query that finds the top 5 prescribers in Nashville in terms of the total number of claims (total_claim_count) across all drugs. Report the npi, the total number of claims, and include a column showing the city.
    b. Now, report the same for Memphis.
    c. Combine your results from a and b, along with the results for Knoxville and Chattanooga.

In [28]:
query_3 = '''
WITH
	nashville AS (
		SELECT 
			npi,
			SUM(total_claim_count) AS total_claims,
			nppes_provider_city AS city
		FROM prescription
		LEFT JOIN prescriber
		USING(npi)
		WHERE nppes_provider_city = 'NASHVILLE'
		GROUP BY npi, nppes_provider_city
		ORDER BY total_claims DESC
		LIMIT 5
	),
	memphis AS (
	SELECT 
			npi,
			SUM(total_claim_count) AS total_claims,
			nppes_provider_city AS city
		FROM prescription
		LEFT JOIN prescriber
		USING(npi)
		WHERE nppes_provider_city = 'MEMPHIS'
		GROUP BY npi, nppes_provider_city
		ORDER BY total_claims DESC
		LIMIT 5
	),
	knoxville AS (
	SELECT 
			npi,
			SUM(total_claim_count) AS total_claims,
			nppes_provider_city AS city
		FROM prescription
		LEFT JOIN prescriber
		USING(npi)
		WHERE nppes_provider_city = 'KNOXVILLE'
		GROUP BY npi, nppes_provider_city
		ORDER BY total_claims DESC
		LIMIT 5
	),
	chattanooga AS (
	SELECT 
			npi,
			SUM(total_claim_count) AS total_claims,
			nppes_provider_city AS city
		FROM prescription
		LEFT JOIN prescriber
		USING(npi)
		WHERE nppes_provider_city = 'CHATTANOOGA'
		GROUP BY npi, nppes_provider_city
		ORDER BY total_claims DESC
		LIMIT 5
	)
SELECT *
FROM nashville
UNION ALL 
SELECT *
FROM knoxville
UNION ALL
SELECT *
FROM chattanooga
UNION ALL
SELECT *
FROM memphis

'''

result_3 = engine.execute(query_3)

answer_3 = pd.read_sql(query_3, con = engine)
answer_3

             npi  total_claims         city
0   1.538104e+09       53622.0    NASHVILLE
1   1.497894e+09       29929.0    NASHVILLE
2   1.659332e+09       26013.0    NASHVILLE
3   1.881639e+09       25511.0    NASHVILLE
4   1.962500e+09       23703.0    NASHVILLE
5   1.295762e+09       31952.0    KNOXVILLE
6   1.528094e+09       24872.0    KNOXVILLE
7   1.508869e+09       21995.0    KNOXVILLE
8   1.194794e+09       21719.0    KNOXVILLE
9   1.588638e+09       21349.0    KNOXVILLE
10  1.568494e+09       31552.0  CHATTANOOGA
11  1.548235e+09       25127.0  CHATTANOOGA
12  1.013995e+09       19305.0  CHATTANOOGA
13  1.437192e+09       18415.0  CHATTANOOGA
14  1.891735e+09       17139.0  CHATTANOOGA
15  1.346291e+09       65659.0      MEMPHIS
16  1.225057e+09       62301.0      MEMPHIS
17  1.801897e+09       40169.0      MEMPHIS
18  1.669470e+09       39491.0      MEMPHIS
19  1.275601e+09       36190.0      MEMPHIS

4. Find all counties which had an above-average (for the state) number of overdose deaths in 2017. Report the county name and number of overdose deaths.

In [29]:
query_4 = '''
WITH 
	cte AS (
		SELECT county, overdose_deaths, AVG(overdose_deaths) OVER() as overall_avg
		FROM overdose_deaths
		JOIN fips_county
		USING(fipscounty)
		WHERE year = 2017
	)
SELECT cte.county, cte.overdose_deaths
FROM cte
WHERE cte.overdose_deaths > cte.overall_avg
ORDER BY overdose_deaths DESC
'''

result_4 = engine.execute(query_4)

answer_4 = pd.read_sql(query_4, con = engine)
answer_4

        county  overdose_deaths
0         KNOX            196.0
1     DAVIDSON            184.0
2       SHELBY            159.0
3     HAMILTON             60.0
4   RUTHERFORD             48.0
5     ANDERSON             34.0
6     SULLIVAN             29.0
7       BLOUNT             29.0
8       SUMNER             28.0
9       WILSON             26.0
10    CHEATHAM             24.0
11  WILLIAMSON             24.0
12  WASHINGTON             24.0
13      SEVIER             24.0
14  MONTGOMERY             22.0
15      LOUDON             18.0
16      GREENE             17.0
17      CARTER             16.0
18       ROANE             16.0
19   ROBERTSON             15.0
20     BRADLEY             14.0

5.
    a. Write a query that finds the total population of Tennessee.
    b. Build off of the query that you wrote in part a to write a query that returns for each county that county's name, its population, and the percentage of the total population of Tennessee that is contained in that county.

In [30]:
query_5 = '''
WITH
	cte AS (
		SELECT county, population, SUM(population) OVER() AS total_pop
		FROM population
		JOIN fips_county
		USING(fipscounty)
	)
SELECT cte.county, cte.population, ROUND(cte.population / cte.total_pop*100, 2) AS pct_total_pop
FROM cte
'''

result_5 = engine.execute(query_5)

answer_5 = pd.read_sql(query_5, con = engine)
answer_5

        county  population  pct_total_pop
0     ANDERSON     75538.0           1.14
1      BEDFORD     46854.0           0.71
2       BENTON     16154.0           0.24
3      BLEDSOE     14413.0           0.22
4       BLOUNT    127135.0           1.93
..         ...         ...            ...
90       WAYNE     16713.0           0.25
91     WEAKLEY     33776.0           0.51
92       WHITE     26394.0           0.40
93  WILLIAMSON    212161.0           3.22
94      WILSON    128874.0           1.95

[95 rows x 3 columns]